Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This configuration only impacts resources served from the fixed or static URL, `/public`, which might not match your application resources if `quarkus.http.root-path` has been set to something other than `/`.
ja_jp: この設定は、固定または静的 URL `/public` から提供されるリソースにのみ影響します。この URL は、 `quarkus.http.root-path` が `/` 以外に設定されていると、アプリケーションリソースとマッチしない可能性があります。

source: This configuration property is important but we will discuss it a bit later.
ja_jp: この設定プロパティーは重要ですが、後ほど少し説明します。

source: This configuration property is important, but we will discuss it a bit later.
ja_jp: この設定プロパティーは重要ですが、説明は少し後になります。

source: This configuration references Keycloak which will be used by `ProtectedResource` to verify the incoming access tokens and by `OidcClient` to get the tokens for a user `alice` using a `password` grant. Both RESTClients point to `ProtectedResource`'s HTTP address.
ja_jp: この設定は Keycloak を参照します。この Keycloak は、受信アクセストークンを検証するために `ProtectedResource` によって使用され、 `password` グラントを使用してユーザー `alice` のトークンを取得するために `OidcClient` によって使用されます。どちらの RESTClient も `ProtectedResource` の HTTP アドレスを指しています。

source: This configuration snippet will create two persistence units:
ja_jp: この設定スニペットは2つの永続化ユニットを作成します:

source: This configuration value is only required if there is more than one Reactive driver extension on the classpath.
ja_jp: この設定値は、クラスパスに複数の Reactive ドライバーエクステンションがある場合にのみ必要です。

source: This configuration value is only required if there is more than one database extension on the classpath.
ja_jp: この設定値は、クラスパスに複数のデータベースエクステンションがある場合にのみ必要です。

source: This configuration will cause all REST Clients, including `my-client`, to use the proxy at `localhost:8182` with the provided credentials.
ja_jp: この設定により、 `my-client` を含むすべての REST Client は、提供されたクレデンシャルで `localhost:8182` のプロキシーを使用するようになります。

source: This configuration will generate the following secured Ingress resource:
ja_jp: この設定では、以下のようなセキュアな Ingress リソースが生成されます。

source: This configuration will only impact resources served from the fixed/static URL `/public`, which may not match your application resources if `quarkus.http.root-path` has been set to something other than `/`.
ja_jp: この設定は、固定/静的URL `/public` から提供されるリソースにのみ影響します。 `quarkus.http.root-path` が `/` 以外に設定されている場合、アプリケーションリソースと一致しない可能性があります。

source: This configuration will:
ja_jp: この設定では、以下が実行されます。

source: This configures the Kafka bootstrap server, the two topics and the corresponding (de-)serializers. More details about the different configuration options are available on the https://kafka.apache.org/documentation/#producerconfigs[Producer configuration] and https://kafka.apache.org/documentation/#consumerconfigs[Consumer configuration] section from the Kafka documentation.
ja_jp: これは、Kafka ブートストラップサーバー、2 つのトピック、および対応する (デ)シリアライザを設定します。さまざまな設定オプションの詳細については、Kafka ドキュメントの link:https://kafka.apache.org/documentation/#producerconfigs[Producer 設定] と link:https://kafka.apache.org/documentation/#consumerconfigs[Consumer 設定] のセクションを参照してください。

source: This configures the default keystore for the Quarkus HTTP server, which allows the server to use the certificate. For information about using this certificate in a named configuration, see xref:referencing-a-tls-configuration[].
ja_jp: これにより、Quarkus HTTP サーバーのデフォルトのキーストアが設定され、サーバーが証明書を使用できるようになります。 名前付き設定でこの証明書を使用する方法については、xref:referencing-a-tls-configuration[] を参照してください。

source: This connector is for AMQP 1.0. RabbitMQ implements AMQP 0.9.1. RabbitMQ does not provide AMQP 1.0 by default, but there is a plugin for it. To use RabbitMQ with this connector, enable and configure the AMQP 1.0 plugin.
ja_jp: このコネクターは AMQP 1.0 用です。RabbitMQ は AMQP 0.9.1 を実装します。RabbitMQ はデフォルトで AMQP 1.0 を提供していませんが、そのためのプラグインがあります。このコネクターで RabbitMQ を使用するには、AMQP 1.0 プラグインを有効にして設定します。

source: This constructor will be used by Hibernate, and it must have a matching constructor with all the class attributes as parameters.
ja_jp: このコンストラクタはHibernate によって使用されます。このコンストラクタはクラス内の唯一のコンストラクタであり、パラメータとしてクラスのすべての属性を持つ必要があります。

source: This constructor will be used by Hibernate, it must be the only constructor in your class and have all the class attributes as parameters.
ja_jp: このコンストラクタはHibernate によって使用されます。このコンストラクタはクラス内の唯一のコンストラクタであり、パラメータとしてクラスのすべての属性を持つ必要があります。

source: This context object also allows you to fall down to the underlying https://www.graphql-java.com/[graphql-java] features by using the leaky abstraction:
ja_jp: また、このコンテキストオブジェクトは、リーキーな抽象化を利用することで、基礎となる https://www.graphql-java.com/[graphql-java] の機能にフォールダウンすることを可能にします。

source: This covers the core Quarkus work, but, as discussed later, several improvements were also made to the https://github.com/smallrye/smallrye-open-api[SmallRye OpenAPI project]. For those contributions, I would like to thank Mike Edgar and Martin Panzer.
ja_jp: これは主要なQuarkusの作業を対象としていますが、後述するように、 https://github.com/smallrye/smallrye-open-api[SmallRye OpenAPIプロジェクト] にもいくつかの改善が加えられました。これらの貢献に対して、Mike Edgar氏とMartin Panzer氏に感謝いたします。

source: This creates `custom-rest.jfc` as a configuration file with recording for RestStart and RestEnd enabled.
ja_jp: これにより、RestStart と RestEnd の記録が有効になっている設定ファイルとして `custom-rest.jfc` が作成されます。

source: This creates a new project importing the quarkus-artemis-jms extension:
ja_jp: これにより quarkus-artemis-jmsエクステンションをインポートした新しいプロジェクトが作成されます:

source: This creates four copies of the incoming channel under the hood, wiring them to the same processing method. Depending on the broker technology, this can be useful to increase the application's throughput by processing multiple messages concurrently while still preserving the partial order of messages received in different copies. This is the case, for example, for Kafka, where multiple consumers can consume different topic partitions.
ja_jp: これにより、内部的に着信チャネルのコピーが 4 つ作成され、同じ処理方法にワイヤリングされます。 これは、ブローカーテクノロジーによっては、異なるコピーで受信されたメッセージの部分的な順序を保持したまま、 複数のメッセージを同時に処理することでアプリケーションのスループットを向上させる際に役立つ場合があります。 たとえば、複数のコンシューマーが異なるトピックパーティションを消費できる Kafka の場合がこれに該当します。

source: This creates the `aggregator` project with the Quarkus extension for Kafka Streams and with RESTEasy support for Jackson.
ja_jp: これにより、Kafka Streams用のQuarkusエクステンションとJackson用のRESTEasyサポートを備えた `aggregator` プロジェクトが作成されます。

source: This creates the `aggregator` project with the Quarkus extension for Kafka Streams and with the Jackson support for Quarkus REST (formerly RESTEasy Reactive).
ja_jp: これにより、Kafka Streams用のQuarkusエクステンションと、Quarkus REST（旧RESTEasy Reactive）用のJacksonサポートが付いた `aggregator` プロジェクトが作成されます。

source: This creates the `aggregator` project with the Quarkus extension for Kafka Streams and with the Jackson support for RESTEasy Reactive.
ja_jp: これにより、Kafka Streams用のQuarkusエクステンションとJackson用のRESTEasyリアクティブを備えた `aggregator` プロジェクトが作成されます。

source: This curl example will create a new Input of type GELF UDP, it uses the default login from Graylog (admin/admin).
ja_jp: この curl の例では、Graylog (admin/admin) からのデフォルトのログインを使用し、GELF UDP タイプの新しい入力を作成します。

source: This currently does not support the `@ApplicationPath()` annotation to set the JAX-RS context path. Use the `quarkus.resteasy.path` config value instead if you want a custom context path.
ja_jp: これは現在、JAX-RS のコンテキストパスを設定するための `@ApplicationPath()` アノテーションをサポートしていません。カスタムのコンテキストパスを設定したい場合は、代わりに `quarkus.resteasy.path` の設定値を使用してください。

source: This currently does not support the `@ApplicationPath()` annotation to set the Jakarta REST context path. Use the `quarkus.resteasy.path` config value instead if you want a custom context path.
ja_jp: 現在、Jakarta RESTのコンテキストパスを設定するための `@ApplicationPath()` アノテーションをサポートしていません。カスタムコンテキストパスが必要な場合は、 代わりに `quarkus.resteasy.path` の設定値を使用してください。

source: This debugging guide has the following requirements:
ja_jp: このデバッグガイドには、次の要件があります。

source: This debugging guide provides further details on debugging issues in Quarkus native executables that might arise during development or production.
ja_jp: このデバッグガイドでは、開発中または生産中に発生する可能性のあるQuarkusネイティブ実行可能ファイルの問題のデバッグについて、さらに詳しく説明します。

source: This declarative approach to resilience means Polaris automatically retries failed writes to the metadata store, with configurable backoff and jitter to prevent thundering herd problems. Note that all the configured values can be overridden in the application configuration.
ja_jp: この宣言的な回復性アプローチにより、Polaris はメタデータストアへの失敗した書き込みを、設定可能なバックオフとジッターで自動的に再試行し、サンダリングハーダ問題を防止します。設定されたすべての値は、アプリケーション設定で上書きできることに注意してください。

source: This declares a template with path `templates/HelloResource/hello`.
ja_jp: これは、パス `templates/HelloResource/hello.txt` でテンプレートを宣言します。

source: This declares a template with path `templates/hello.txt`. The `name` parameter is automatically turned into a <<typesafe_expressions,parameter declaration>> and so all expressions that reference this name will be validated.
ja_jp: これは、パス `templates/hello.txt` を持つテンプレートを宣言します。 `name` パラメーターは自動的に link:#typesafe_expressions[パラメーター宣言] に変換されるので、この名前を参照するすべての式が検証されます。

source: This declares a template with path `templates/hello.txt`. The `name` parameter is automatically turned into a <<typesafe_expressions,parameter declaration>>, so that all expressions referencing this name will be validated.
ja_jp: これは、パス `templates/hello.txt` を持つテンプレートを宣言します。`name` パラメーターは自動的に <<typesafe_expressions,parameter declaration>> に変換されるため、この名前を参照するすべての式が検証されます。

source: This declares a template with path `templates/hello.txt`. The `name` parameter is automatically turned into a xref:typesafe_expressions[parameter declaration], so that all expressions referencing this name will be validated.
ja_jp: これは、パスが `templates/hello.txt` のテンプレートを宣言しています。 `name` パラメータは自動的に xref:typesafe_expressions[パラメータ宣言] になり、この名前を参照するすべての式が検証されるようになります。

source: This declares a template with path `templates/hello`.
ja_jp: これは、パス `templates/hello.txt` でテンプレートを宣言します。

source: This decouples access control logic from the application code, making it easier to manage and update access policies directly in Keycloak.
ja_jp: これにより、アクセス制御ロジックがアプリケーションコードから分離され、Keycloak で直接アクセスポリシーを管理および更新しやすくなります。

source: This defaults to the current origin on which Quarkus is deployed, but can be <<quarkus-security-webauthn_quarkus-webauthn-origins,configured>>.
ja_jp: これは Quarkus がデプロイされている現在のオリジンにデフォルト設定されますが、<<quarkus-security-webauthn_quarkus-webauthn-origins,設定>> することができます。

source: This defines a role based policy that allows users with the `user` and `admin` roles. This is referenced by later rules.
ja_jp: これは、 `user` と `admin` のロールを持つユーザーを許可するロールベースのポリシーを定義します。これは後のルールで参照されます。

source: This defines a role-based policy that allows users with the `user` and `admin` roles.
ja_jp: これは、 `user` ロールと `admin` ロールを持つユーザーを許可するロールベースのポリシーを定義します。

source: This definition is very important as we will have to use it in the service. Once we have this `Command` we can start to update the redis-client extension by:
ja_jp: この定義は、サービスの中で使用する必要があるため、非常に重要です。 この `Command` ができたら、redis-client extension を以下のように更新していきます:

source: This degradation of performance doesn't seem to come from virtual threads themselves but from the interactions between Vert.x/Netty (Quarkus underlying reactive engine) and the virtual threads. This was illustrated in the issue that we will now describe.
ja_jp: この性能低下は仮想スレッドそのものが原因ではなく、Vert.x/Netty（Quarkusの基盤となるリアクティブエンジン）と仮想スレッドの間の相互作用に起因しているようです。このことは、これから説明する問題にも表れています。

source: This demonstrates that WebAssembly is not just a browser technology, but rather a powerful tool for cross-language interoperability in cloud-native applications, and showcases how to integrate this workflow easily in Quarkus applications, thanks to Quarkus Chicory.
ja_jp: これは、WebAssembly が単なるブラウザー技術ではなく、クラウドネイティブアプリケーションにおける言語間相互運用のための強力なツールであることを示しています。また、Quarkus Chicory のおかげで、このワークフローを Quarkus アプリケーションに簡単に統合できることも実証されました。

source: This dependency is already included in this guide's pom.xml, but if you are starting a new project from scratch, make sure to include it.
ja_jp: この依存関係は、本書の pom.xml にすでに含まれていますが、新しいプロジェクトを最初から開始する場合は必ず追加するようにしてください。

source: This dependency provides the Vert.x Web Client, which we will be using to implement the `/web` endpoint.
ja_jp: この依存関係は、Vert.x Web クライアントを提供し、 `/web` エンドポイントの実装に使用されます。

source: This dependency provides the callback handler required to handle the OAuth workflow. Then, in the `application.properties`, add:
ja_jp: この依存関係は、OAuth ワークフローを処理するために必要なコールバックハンドラーを提供します。そして、 `application.properties` で追加します。

source: This development model should look familiar if you are a Java EE or Spring user. You expose a resource containing methods annotated with `@GET`, `@POST` to handle the different requests. Quarkus also proposes a https://quarkus.io/guides/spring-web[compatibility layer with Spring APIs], so you can also use `@GetMapping` and `@RestController`.
ja_jp: Java EE または Spring ユーザーであれば、この開発モデルはおなじみのはずです。`@GET`、`@POST` でアノテーションされたメソッドを含むリソースを公開して、さまざまなリクエストを処理します。Quarkus は https://quarkus.io/guides/spring-web[Spring API との互換性レイヤー] も提供しているため、`@GetMapping` と `@RestController` も使用できます。

source: This document clarifies different HTTP functionalities available in Quarkus.
ja_jp: このドキュメントでは、Quarkusで利用可能なさまざまなHTTP機能について説明します。

source: This document describes how to test Quarkus Security.
ja_jp: このドキュメントでは、Quarkus Securityのテスト方法について説明します。

source: This document describes the Quarkus built-in authentication mechanisms for HTTP based FORM, BASIC and Mutual TLS authentication as well as the proactive authentication.
ja_jp: このドキュメントでは、HTTPベースのFORM認証、BASIC認証、相互TLS認証、およびプロアクティブ認証のためのQuarkusの組み込み認証メカニズムについて説明します。

source: This document explains duplicated contexts, how to retrieve one, use it, and how it's propagated along the (asynchronous) processing.
ja_jp: このドキュメントでは、複製コンテキストについて、その取得方法、使用方法、（非同期）処理での伝搬方法を説明します。

source: This document explains how the dev mode in Quarkus differs from a production application.
ja_jp: このドキュメントでは、Quarkus の開発モードが本番アプリケーションとどのように異なるかを説明します。

source: This document explains how the dev-mode in Quarkus differs from a production application.
ja_jp: このドキュメントでは、Quarkusのdev-modeが本番アプリケーションとどのように異なるかを説明します。

source: This document explains how to configure well-known social OIDC and OAuth2 providers.
ja_jp: このドキュメントでは、よく知られているソーシャル OIDC および OAuth2 プロバイダの設定方法について説明します。

source: This document explains how to optimize your AWS Lambda application for SnapStart
ja_jp: このドキュメントでは、AWS Lambda application for SnapStartの最適化について解説します

source: This document explains the Quarkus class loading architecture. It is intended for extension authors and advanced users who want to understand exactly how Quarkus works.
ja_jp: このドキュメントでは、Quarkus のクラスロードアーキテクチャについて説明します。このドキュメントは、Quarkus がどのように動作するかを正確に理解したいエクステンションの作者や上級ユーザーを対象としています。

source: This document explains various HTTP features that you can use in Quarkus.
ja_jp: このドキュメントでは、Quarkus で使用できるさまざまな HTTP 機能について説明します。

source: This document is part of the xref:observability.adoc[Observability in Quarkus reference guide] which features this and other observability related components.
ja_jp: このドキュメントは、 xref:observability.adoc[QuarkusのObservabilityリファレンスガイド] の一部です。

source: This document presents how you can use a separate HTTP server (bound to a different network interface and port) for the management endpoints. It avoids exposing these endpoints on the main server and, therefore, prevents undesired accesses.
ja_jp: 本書では、マネジメントエンドポイントに別の HTTP サーバー (別のネットワークインターフェイスとポートにバインド) を使用する方法について説明します。これにより、メインサーバー上でこれらのエンドポイントを公開することを避け、望ましくないアクセスを防止することができます。

source: This document provides a brief overview of Quarkus Security and links to the individual guides.
ja_jp: このドキュメントでは、Quarkus Securityの簡単な概要と、各ガイドへのリンクについて説明しています。

source: This document provides an expanded description of the xref:security-oidc-configuration-properties-reference.adoc[OIDC Configuration properties], explains why some properties have been introduced, why they have current default values, and suggests typical property combinations.
ja_jp: このドキュメントでは、xref:security-oidc-configuration-properties-reference.adoc[OIDC 設定プロパティー] の詳細な説明を提供し、一部のプロパティーが導入された理由、現在のデフォルト値になっている理由、および典型的なプロパティーの組み合わせを提案します。

source: This document refers to the `http://localhost:8080/q/dev-ui` Dev UI URL in several places where `q` is a default non-application root path. If you customize `quarkus.http.root-path` or `quarkus.http.non-application-root-path` properties, then replace `q` accordingly. For more information, see the https://quarkus.io/blog/path-resolution-in-quarkus/[Path resolution in Quarkus] blog post.
ja_jp: このドキュメントでは、いくつかの場所で Dev UI URL を `http://localhost:8080/q/dev-ui` と表記しています。`q` は、デフォルトのアプリケーション以外のルートパスです。 `quarkus.http.root-path` または `quarkus.http.non-application-root-path` プロパティーをカスタマイズする場合は、それに応じて `q` を置き換えてください。 詳細は、ブログ記事の https://quarkus.io/blog/path-resolution-in-quarkus/[Path resolution in Quarkus] を参照してください。

source: This document refers to the `http://localhost:8080/q/dev-v1` Dev UI URL in several places where `q` is a default non application root path. If you customize `quarkus.http.root-path` and/or `quarkus.http.non-application-root-path` properties then replace `q` accordingly, please see https://quarkus.io/blog/path-resolution-in-quarkus/[Path Resolution in Quarkus] for more information.
ja_jp: 本ドキュメントでは、様々な場所でDev UI URLを以下のように表記しています: `http://localhost:8080/q/dev-v1` 。 `q` はデフォルトの非アプリケーションルートパスです。 `quarkus.http.root-path` や `quarkus.http.non-application-root-path` のプロパティをカスタマイズした場合は、それに応じて `q` を置き換えて下さい。詳細は link:https://quarkus.io/blog/path-resolution-in-quarkus/[Quarkusのパス解決] を参照してください。

source: This document refers to the `http://localhost:8080/q/dev` Dev UI URL in several places where `q` is a default non application root path. If you customize `quarkus.http.root-path` and/or `quarkus.http.non-application-root-path` properties then replace `q` accordingly, please see https://quarkus.io/blog/path-resolution-in-quarkus/[Path Resolution in Quarkus] for more information.
ja_jp: このドキュメントでは、繰り返し `http://localhost:8080/q/dev` Dev UI URL を参照していますが、この `q` はデフォルトの非アプリケーションルートパスです。 `quarkus.http.root-path` や `quarkus.http.non-application-root-path` プロパティーをカスタマイズした場合、 `q` を適宜置き換えてください。詳細については、 https://quarkus.io/blog/path-resolution-in-quarkus/[Quarkus を使用したパスの解決] を参照してください。

source: This document shows how static resources can be served from web dependency jars like https://www.webjars.org[WebJars] and https://mvnpm.org[mvnpm].
ja_jp: このドキュメントでは、 https://www.webjars.org[WebJars] および https://mvnpm.org[mvnpm] などの Web 依存関係 jar から静的リソースを提供する方法を説明します。

source: This documentation does not cover all the details of the connector. Refer to the https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging website] for further details.
ja_jp: このドキュメントは、コネクターのすべての詳細を網羅しているわけではありません。詳細については、 https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging website] サイトを参照してください。

source: This dual capability, supporting both model training and RAG processes, makes Java uniquely powerful in AI architectures.
ja_jp: モデルトレーニングとRAGプロセスの両方をサポートするこの二重の機能により、JavaはAIアーキテクチャにおいて他に類を見ないほどの強力さを発揮します。

source: This eliminates version management headaches when using multiple SDK modules, and their dependencies.
ja_jp: これにより、複数のSDKモジュールとその依存関係を使用する際のバージョン管理の悩みを解消します。

source: This enabled the client to fetch the required data in a single request.
ja_jp: これにより、クライアントは1回のリクエストで必要なデータを取得できるようになりました。

source: This enables the deployment of Quarkus applications to platforms like Kubernetes, Knative, and OpenShift. All without requiring changes to the project dependencies or configuration, simplifying developer experience.
ja_jp: これにより、QuarkusアプリケーションをKubernetes、Knative、OpenShiftなどのプラットフォームへデプロイすることができます。すべて、プロジェクトの依存関係や設定に変更を加える必要がなく、開発者体験をシンプルにします。

source: This end-to-end integration means going from source code to an AOT-optimized container image in a single command.
ja_jp: このエンドツーエンドの統合は、単一のコマンドでソースコードから AOT 最適化されたコンテナーイメージへの移行を意味します。

source: This endpoint accepts `POST` requests with `application/json` content type only. All indexed entities will be re-indexed if an empty request body is submitted.
ja_jp: このエンドポイントは、 `application/json` コンテンツタイプのみの `POST` リクエストを受け入れます。 空のリクエスト本文が送信された場合、インデックスが作成されたすべてのエンティティーはインデックスが再作成されます。

source: This endpoint accepts `POST` requests with `application/json` content type only. All indexed entities will be re-indexed if an empty request body is submitted. If only a subset of entities must be re-indexed or if there is a need to have a custom configuration of the underlying mass indexer then this information can be passed through the request body as shown below.
ja_jp: このエンドポイントは、 `application/json` コンテンツタイプのみの `POST` リクエストを受け入れます。 空のリクエストボディーが送信された場合、インデックス化されたすべてのエンティティーは再度インデックス化されます。 エンティティーのサブセットのみを再インデックス化する必要がある場合、または 基礎となる大量インデクサーのカスタム設定が必要な場合、 以下のようにこの情報をリクエストボディーを介して渡すことができます。

source: This endpoint handles HTTP `GET` request on path `/lorem` (so the full path will be `vertx/lorem`)
ja_jp: このエンドポイントは、パス `/lorem` に対する HTTP `GET` リクエストを処理します（そのため、フルパスは `vertx/lorem` となります）。

source: This endpoint has ID, access and refresh tokens injected. It returns a `preferred_username` claim from the ID token, a `scope` claim from the access token and also a refresh token availability status.
ja_jp: このエンドポイントには、ID、アクセス、およびリフレッシュ トークンが注入されています。ID トークンから `preferred_username` クレーム、アクセス トークンから `scope` クレーム、およびリフレッシュ トークンの可用性ステータスを返します。

source: This endpoint has ID, access, and refresh tokens injected. It returns a `preferred_username` claim from the ID token, a `scope` claim from the access token, and a refresh token availability status.
ja_jp: このエンドポイントには、ID、アクセス、およびリフレッシュ・トークンが注入されています。ID トークンからの `preferred_username` クレーム、アクセストークンからの `scope` クレーム、リフレッシュトークンの可用性ステータスを返します。

source: This endpoint has ID, access, and refresh tokens injected. It returns a `preferred_username` claim from the ID token, a `scope` claim from the access token, and also a refresh token availability status.
ja_jp: このエンドポイントには、ID、アクセス、リフレッシュの各トークンが注入されています。IDトークンから `preferred_username` 、アクセストークンから `scope` 、さらにリフレッシュトークンの可用性ステータスを返します。

source: This endpoint is exposed at `/secured/roles-allowed`.
ja_jp: このエンドポイントは `/secured/roles-allowed` で公開されます。

source: This endpoint requires authentication, because when no standard security annotation accompanies the `@BasicAuthentication` annotation, the `@Authenticated` annotation is added by default.
ja_jp: `@BasicAuthentication` アノテーションに標準のセキュリティーアノテーションが付属していない場合は、デフォルトで `@Authenticated` アノテーションが追加されるため、このエンドポイントには認証が必要です。

source: This endpoint returns a JSON Array. Vert.x provides a convenient way to manipulate JSON Object and Array. More details about these in xref:vertx-reference.adoc#using-vert-x-json[the reference guide].
ja_jp: このエンドポイントは、JSON Array を返します。Vert.x は、JSON オブジェクトと配列を操作する便利な方法を提供します。これらの詳細については、 xref:vertx-reference.adoc#using-vert-x-json[リファレンスガイド] を参照してください。

source: This endpoint uses a greeting service:
ja_jp: このエンドポイントは、グリーティングサービスを利用しています:

source: This endpoint will be automatically generated based on business process, that in turn will make use of business rules to make certain decisions based on the data being processed.
ja_jp: このエンドポイントは、ビジネスプロセスに基づいて自動的に生成され、ひいてはビジネスルールを利用して処理中のデータに基づいて一定の判断を下すことになります。

source: This endpoint will be automatically generated based on given PMML file, that in turn will make use of generated code to make certain predictions based on the data being processed.
ja_jp: このエンドポイントは、与えられたPMMLファイルに基づいて自動的に生成されます。生成されたコードを使用して、処理されるデータに基づいて特定の予測を行います。

source: This endpoint will be automatically generated based on the defined DMN model.
ja_jp: このエンドポイントは、定義されたDMNモデルに基づいて自動的に生成されます。
